In [1]:
'''
seaborn의 타이타닉 데이터를 불러오자
'''

'\nseaborn의 타이타닉 데이터를 불러오자\n'

In [129]:
import seaborn as sns
import numpy as np
import pandas as pd

In [57]:
df = sns.load_dataset('titanic')

In [ ]:
'''
테이터프레임 구조 확인
'''

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
df.shape

(891, 15)

In [ ]:
'''
이때 info()를 통해 어느 데이터에 누락 데이터가 많은지를 확인하자.
문제가 있는지 확인을 해야한다.
그 열이 가진 고유값을 확인해 보자.
value_counts로 확인을 하자. 이때 NaN을 포함시켜야한다.
'''

In [7]:
df.info() # 실전에서 head 에서 숫자인데 문자라고 적힌 부분이 있음... 그 데이터 확인해야함

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [14]:
df.describe(include = 'all')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
df['age'].value_counts(dropna = False)

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
66.00      1
23.50      1
0.42       1
Name: age, Length: 89, dtype: int64

In [11]:
df['embarked'].value_counts(dropna = False)

S      644
C      168
Q       77
NaN      2
Name: embarked, dtype: int64

In [12]:
df['deck'].value_counts(dropna = False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [13]:
df['embark_town'].value_counts(dropna = False)

Southampton    644
Cherbourg      168
Queenstown      77
NaN              2
Name: embark_town, dtype: int64

In [ ]:
# 1단계_누락 데이터 처리
'''
for 반복문으로 각 열의 NaN 개수 계산하기
'''

In [21]:
for col in df.columns:
    try:
        print(col,':', df[col].isnull().value_counts(dropna = False)[True])
    except:
        print(col,':',0)

survived : 0
pclass : 0
sex : 0
age : 177
sibsp : 0
parch : 0
fare : 0
embarked : 2
class : 0
who : 0
adult_male : 0
deck : 688
embark_town : 2
alive : 0
alone : 0

In [ ]:
# 2단계_누락 데이터 제거
'''
# NaN 값이 500개 이상인 열을 모두 삭제
'''

In [33]:
df1 = df.dropna(axis = 1, thresh = 500)

In [34]:
df1.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [35]:
df1.shape # deck 삭제

(891, 14)

In [ ]:
'''
# age 열에 나이 데이터가 없는 모든 행을 삭제 
'''

In [ ]:
# 강사님 코드
df_age = (df.dropna[subset = ['age'], how = 'any', axis = 0])

In [36]:
df1.dropna(subset = ['age'], inplace = True)

<ipython-input-36-31775ee8b3ad>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.dropna(subset = ['age'], inplace = True)

In [37]:
df1.shape

(714, 14)

In [40]:
df1['age'].value_counts(dropna = False)

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [ ]:
# 2단계_누락 데이터 치환
'''
age 열의 첫 10개 데이터 출력 (5 행에 NaN 값)
'''

In [41]:
df['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [133]:
# nan 위치 찾기
df = sns.load_dataset('titanic')
a = df['age'].head(10)

In [134]:
# NaN 값 위치 찾기
for idx, val in enumerate(a):
    if str(val) == 'nan':
        print(idx, val)

5 nan

In [ ]:
'''
age 열의 NaN값을 다른 나이 데이터의 평균으로 변경하기
+ 중간값으로 변경해보기
+ 최빈값으로 변경해보기
'''

In [52]:
# 평균으로 대체
df = sns.load_dataset('titanic')

mean_age = df['age'].mean(axis = 0)
print(mean_age)
df['age'].fillna(mean_age, inplace = True)

29.69911764705882

In [56]:
df['age'].head(10)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [61]:
# 중앙값으로 대체
df = sns.load_dataset('titanic')

median_age = df['age'].median(axis = 0)
print(median_age)
df['age'].fillna(median_age, inplace = True)

28.0

In [62]:
df['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    28.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [69]:
# 최빈값으로 대체
df = sns.load_dataset('titanic')

most_freq = df['age'].value_counts(dropna = True).idxmax() # 결측을 제외
print(most_freq)
df['age'].fillna(most_freq, inplace = True)

24.0

In [70]:
df['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    24.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [136]:
'''
CASE 1 
embark_town 열의 829행의 NaN 데이터 출력
'''
a = df['embark_town']

# NaN 값 위치 찾기
for idx, val in enumerate(a):
    if str(val) == 'nan':
        print(idx, val)

61 nan
829 nan

In [85]:
df = sns.load_dataset('titanic')
df['embark_town'].value_counts(dropna = False)

Southampton    644
Cherbourg      168
Queenstown      77
NaN              2
Name: embark_town, dtype: int64

In [86]:
df.loc[829,'embark_town']

nan

In [ ]:
'''
embark_town 열의 NaN값을 승선도시 중에서 가장 많이 출현한 값으로 치환하기
'''

In [88]:
df.loc[829,'embark_town'] = 'Southampton'
df.loc[829,'embark_town']

'Southampton'

In [ ]:
'''
embark_town 열 829행의 NaN 데이터 출력 (NaN 값이 most_freq 값으로 대체)
'''

In [90]:
df = sns.load_dataset('titanic')
most_embark_town = df['embark_town'].value_counts(dropna = True).idxmax()
df['embark_town'].fillna('Southampton', inplace = True)
# print(df.loc[829,'embark_town'])
df['embark_town'].value_counts(dropna = False)

Southampton    646
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [ ]:
'''
CASE 2
embark_town 열의 NaN값을 바로 앞에 있는 828행의 값으로 변경하기
'''

In [103]:
df = sns.load_dataset('titanic')
print(df.loc[829,'embark_town'])
df['embark_town'].fillna(method = 'ffill', inplace = True) # ffill-front fill, bfill - back fill
df.loc[829,'embark_town']

nan

'Queenstown'

In [ ]:
'''
age 열의 첫 10개 데이터 출력 (5 행에 NaN 값이 평균으로 대체)

'''

In [115]:
df = sns.load_dataset('titanic')
print(df['age'].head(10))
mean_age = df['age'].mean()
print()
print(mean_age)
print()
df['age'].fillna(mean_age, inplace = True)
print(df['age'].head(10))

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

29.69911764705882

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

## 실습

In [116]:
# 라이브러리 불러오기
import pandas as pd

# 중복 데이터를 갖는 데이터프레임 만들기
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})

In [119]:
'''
데이터프레임 전체 행 데이터 중에서 중복값 찾기
'''
print(df)
df.duplicated()

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [120]:
'''
데이터프레임의 특정 열 데이터에서 중복값 찾기
'''
df['c1'].duplicated()

0    False
1     True
2    False
3     True
4     True
Name: c1, dtype: bool

In [123]:
'''
데이터프레임에서 중복 행을 제거
'''
df1 = df.drop_duplicates()
print(df1)

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [128]:
'''
c2, c3열을 기준으로 중복 행을 제거
'''
print(df)
print()
df2 = df.drop_duplicates(subset = ['c2', 'c3']) # subset 굳이 안써도 괜찮
print(df2)

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2